{"dt-api":{"summary":"Get the DataTables cached data for the selected columns.","description":"DataTables caches data for searching and ordering in order for those operations to run as quickly as possible when they are required. Sometimes it can be useful to get the data that DataTables has cached for these operations, for example when creating a `select` list to provide a column based filter.\r\n\r\n\t\tCached data is not guaranteed to be available at any particular moment. If DataTables hasn't requested the data, it won't have been cached. This is particularly obvious when using the `-string order` option and a sort hasn't been performed on a column. Invalidation of data will also cause the cache to be removed.\r\n\r\n\t\tIt should be noted that this method is required as DataTables has the ability to use different data for its different operations (searching, ordering, display etc) - see `dt-init columns.data` and `dt-init columns.render` for further information. `dt-api columns().data()` provides access to the original data. If you aren't using orthogonal data for the different operations of DataTables, then this method is of limited used.\r\n\r\n\t\tPlease note that the order of the data in the returned array and which rows the data is obtained from (searched rows, visible rows etc) is controlled by the `dt-type selector-modifier` option of the `dt-api column()` selector used to get the selected column.\r\n\r\n\t\tNote that this method is primarily aimed at plug-in developers who require access to the internal data that DataTables has stored.","name":"columns().cache()","example":{"content":"\r\nvar table = $('#example').DataTable();\r\n\r\ntable.columns( '.select-filter' ).every( function () {\r\n\tvar that = this;\r\n\r\n\t// Create the select list and search operation\r\n\tvar select = $('<select />')\r\n\t\t.appendTo(\r\n\t\t\tthis.footer()\r\n\t\t)\r\n\t\t.on( 'change', function () {\r\n\t\t\tthat\r\n\t\t\t\t.search( $(this).val() )\r\n\t\t\t\t.draw();\r\n\t\t} );\r\n\r\n\t// Get the search data for the first column and add to the select list\r\n\tthis\r\n\t\t.cache( 'search' )\r\n\t\t.sort()\r\n\t\t.unique()\r\n\t\t.each( function ( d ) {\r\n\t\t\tselect.append( $('<option value=\"'+d+'\">'+d+'<\/option>') );\r\n\t\t} );\r\n} );\r\n\r\n","title":"Build a search for each column with a `select-filter` class."},"since":"1.10","type":{"parameter":{"content":"Specify which cache the data should be read from. Can take one of two values: `dt-string search` or `dt-string order`","name":"type","type":"string"},"description":"Obtain the data for the columns from the selector","returns":{"content":"DataTables API instance with data for each cell in the selected columns in the result set. This is a 2D array with the top level array entries for each column matched by the `dt-api columns()` selector.","type":"DataTables.Api"},"type":"function","signature":"columns().cache( type )"},"group":"columns","related":{"content":"column().cache()","type":"api"}}}