{"dt-api":{"summary":"Redraw the table.","description":"When you perform an action such as adding or deleting a row, changing the sorting, filtering or paging characteristics of the table you'll want DataTables to update the display to reflect these changes. This function is provided for that purpose.\r\n\r\n\t\tA draw is not performed automatically by most DataTables API actions to allow grouping of actions (for example adding multiple rows is more efficient if you group them. Keep in mind that due to the chaining nature of the DataTables API calling the `dt-api draw()` method is just a case of adding `.draw()` to your other API method calls, as shown in the examples below.\r\n\r\n\t\tNote that calling `dt-api draw()` with any option other than the first parameter being `-string page` will result in a full re-order and re-search of the table being performed. The `-string page` option is provided when you wish the table to be updated but for these actions not to occur (for example a page change does not require a full re-order / re-search).","name":"draw()","example":[{"content":"\r\nvar table = $('#example').DataTable();\r\n\r\n$('#myFilter').on( 'keyup', function () {\r\n\ttable\r\n\t\t.search( this.value )\r\n\t\t.draw();\r\n} );\r\n","title":"Filter the table based on a custom input and redraw"},{"content":"\r\nvar table = $('#example').DataTable();\r\n\r\n// Sort by column 1 and then re-draw\r\ntable\r\n\t.order( [[ 1, 'asc' ]] )\r\n\t.draw( false );\r\n","title":"Sort and then redraw the table maintaining current paging position"},{"content":"\r\nvar table = $('#example').DataTable();\r\n\r\ntable.page( 'next' ).draw( 'page' );\r\n","title":"Change the table's page and then redraw (using the `-string page` option)"}],"since":"1.10","type":{"parameter":{"content":"\r\n\t\t\tThis parameter is used to determine what kind of draw DataTables will perform. There are three options available (note that the string options require DataTables 1.10.8 or newer):\r\n\r\n\t\t\t* `-string full-reset` or `true` (default) - the ordering and search will be recalculated and the rows redrawn in their new positions. The paging will be reset back to the first page.\r\n\t\t\t* `-string full-hold` or `false` - the ordering and search will be recalculated and the rows redrawn in their new positions. The paging will **not** be reset - i.e. the current page will still be shown.\r\n\t\t\t* `-string page` - ordering and search will not be updated and the paging position held where is was. This is useful for paging (i.e. `dt-api page()`) when data has not been changed between draws.\r\n\r\n\t\t\tPlease note that the string options require <span class=\"since\">DataTables 1.10.8<\/span> or newer. Previous versions support only the boolean option.\r\n\t\t\t","default":true,"name":"paging","type":"boolean|string"},"description":"Redraw the DataTables in the current context, optionally updating ordering, searching and paging as required.","returns":{"content":"DataTables API instance","type":"DataTables.Api"},"type":"function","signature":"draw( [paging] )"},"group":"core","related":{"content":"drawCallback","type":"option"}}}