{"dt-api":{"summary":"Reduce an Api instance to a single context and result set.","description":"The DataTables API is designed to work with multiple tables (_contexts_) in a single API instance, which can often be useful, but there times when you want to work with just a single table and benefit from the reduced complexity that invites (a scalar rather than vector).\r\n\r\n\t\tThe API's selectors methods will all provide their result sets in a 2D array format, with the outer array used to identify each table in the context, while the inner array contains that table's results from the selector. You can readily loop over each table if needed, but if you are using just a single table, this method can be used to reduce the API instance to just the table in question.\r\n\r\n\t\tAs an illustrative example, the `dt-api rows()` method will return the 2D array format described above, with the the inner array data containing the row indexes selected. For simple manipulation of a single table we want just a 1D array which contains the selected row indexes, and the API instance's context set to the table in question. This is exactly the ability the `dt-api eq()` method provides.","name":"eq()","example":[{"content":"\r\nvar table = $('#example').DataTable();\r\n\r\ntable.rows().eq( 0 ).each( function (idx) {\r\n\tvar row = table.row( idx );\r\n\r\n\tif ( row.data().grade === 'A' ) {\r\n\t\trow.node().to$().addClass( 'gradeA' );\r\n\t}\r\n} );\r\n","title":"Add a class to a row, based on a conditional expression"},{"content":"\r\nvar table = $('#example').DataTable();\r\n\r\ntable.rows().eq( 0 ).each( function (idx) {\r\n\ttable.row( idx ).child.show();\r\n} );\r\n","title":"Display the child rows for all rows in the table"}],"since":"1.10","type":{"parameter":{"content":"Index to select","name":"idx","type":"integer"},"description":"Reduce an API instance to a single context and result set, based on a given index. This can be useful for simplifying some interactions with the API.","returns":{"content":"New DataTables API instance with the context and result set containing the table and data for the index specified, or null if no matching index was available.","type":"DataTables.Api|null"},"type":"function","signature":"eq( idx )"},"group":"utility"}}