{"dt-api":{"summary":"Create a new API instance with all elements from the result set which pass a given test.","description":"The `dt-api filter()` method provides a way of filtering out content in an API instance's result set which does not pass the criteria set by the provided callback method. **This method should not be confused with `dt-api search()` which is used to search for records in the DataTable** - i.e. the filter method does not change the rows that are displayed in the DataTable.\r\n\r\n\t\tWhen working with the plural methods such as `dt-api rows()` and `dt-api columns()` you may wish to use the `dt-api eq()` utility method to reduce the API instance from a 2D array to a 1D array which can be iterated over using this method.\r\n\r\n\t\tThis method makes use of the fact that DataTables API objects are \"array like\", in that they inherit a lot of the abilities and methods of the Javascript `Array` type.\r\n\r\n\t\tIn this case, this method is a proxy for the Javascript `Array.prototype.filter` method and is provided as a utility method for the DataTables API. For more information about the original method, please refer to the [Mozilla MDN documentation for `filter`](https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Global_Objects/Array/filter). In browsers which do not support `filter` natively, a polyfill is provided to allow this DataTables method to operate as expected.","name":"filter()","example":[{"content":"\r\nvar table = $('#example').DataTable();\r\n\r\nvar filteredData = table\r\n\t.column( 0 )\r\n\t.data()\r\n\t.filter( function ( value, index ) {\r\n\t\treturn value > 20 ? true : false;\r\n\t} );\r\n\r\n","title":"Filter data from a column, to just the data that is greater than 20"},{"content":"\r\nvar table = $('#example').DataTable();\r\n\r\nvar filteredData = table\r\n\t.columns( [0, 1] )\r\n\t.data()\r\n\t.eq( 0 )\r\n\t.filter( function ( value, index ) {\r\n\t\treturn value > 20 ? true : false;\r\n\t} );\r\n\r\n","title":"Filter data from multiple columns, to just the data that is greater than 20 through use of the `dt-api eq()` method"}],"since":"1.10","type":{"parameter":{"content":"Callback function which is called for each item in the API instance result set. The callback is called with three parameters:\r\n\r\n\t\t\t* The element value\r\n\t\t\t* The element index in the result set\r\n\t\t\t* The API instance being traversed\r\n\r\n\t\t\tThe callback should return `true` if the value is to be included in the new instance's own result set, and false otherwise.","name":"fn","type":"function"},"description":"Iterate over the result set of an API instance and test each item, creating a new instance from those items which pass.","returns":{"content":"New API instance with the values from the result set which passed the test in the callback.","type":"DataTables.Api"},"type":"function","signature":"filter( fn )"},"group":"utility"}}