{"dt-api":{"summary":"Iterate over a result set of table, row, column or cell indexes","description":{"content":["When working with collections of DataTables indexes (such as those placed into the result set by `dt-api tables()`, `dt-api rows()`, `dt-api columns()` and `dt-api cells()`) you often wish to loop over the indexes an perform some kind of operation on the element that each index points to. While this can easily be accomplished with a `for` loop or two, this method can help to simplify and reduce the code by performing those loops for you.\r\n\r\n\t\t**Important**: Please note that if you are working with `dt-api rows()`, `dt-api columns()` and `dt-api cells()`, as of DataTables 1.10.6 you may wish to use the `dt-api rows().every()`, `dt-api columns().every()` and `dt-api cells().every()` methods to iterate over each row, column or cell with the context set to that table element, as those methods can simply your code beyond what is possible with this `dt-api iterator()` method for the majority of cases.\r\n\r\n\t\tThere are a number of loop types available (specified by the `type` parameter), and these loop types also effect the parameters that are passed into the callback function:\r\n\r\n\t\t* `table` - loop over the context's (i.e. the tables) for the instance\r\n\t\t  1. Table settings object\r\n\t\t  2. Loop counter\r\n\t\t* `columns` - loop over each item in the result set\r\n\t\t  1. Table settings object\r\n\t\t  2. Result set item\r\n\t\t  3. Loop counter\r\n\t\t* `column` - loop over each table and column in the result set\r\n\t\t  1. Table settings object\r\n\t\t  2. Column index\r\n\t\t  3. Table counter (outer)\r\n\t\t  4. Column counter (inner)\r\n\t\t* `column-rows` - loop over each table, column and row in the result set applying `dt-type selector-modifier`.\r\n\t\t  1. Table settings object\r\n\t\t  2. Column index\r\n\t\t  3. Table counter (outer)\r\n\t\t  4. Column counter (inner)\r\n\t\t  5. Row indexes\r\n\t\t* `rows` - loop over each item in the result set\r\n\t\t  1. Table settings object\r\n\t\t  2. Result set item\r\n\t\t  3. Loop counter\r\n\t\t* `row` - loop over each table and row in the result set\r\n\t\t  1. Table settings object\r\n\t\t  2. Row index\r\n\t\t  3. Table counter (outer)\r\n\t\t  4. Row counter (inner)\r\n\t\t* `cell` - loop over each table and cell in the result set\r\n\t\t  1. Table settings object\r\n\t\t  2. Row index\r\n\t\t  3. Column index\r\n\t\t  4. Table counter (outer)\r\n\t\t  5. Cell counter (inner)\r\n\r\n\t\tThe return from the callback effects the return value from this method:\r\n\r\n\t\t* If `returns` parameter is set to `true`, a new API instance will be returned with the results contained in its result set.\r\n\t\t* Otherwise, or `returns` is `false`:\r\n\t\t  * If the callback returns values a new API instance will be returned\r\n\t\t  * Otherwise the original instance will be returned for chaining.\r\n\r\n\t\tThis is slightly complex to ensure backwards compatibility which DataTables versions which did not have a `returns` parameter and attempted to automatically determine if a new API instance was required or not. To simplify, always set `returns` to `true` if your method returns a value.\r\n\r\n\t\tNote as of","the callback function is executed in the scope of a DataTables API instance that as the context of only the table described by the first parameter passed into the function. This can make accessing API method for that specific table much easier."],"span":{"content":"DataTables 1.10.3","class":"since"}},"name":"iterator()","example":{"content":"\r\n\r\ntable.rows().iterator( 'row', function ( context, index ) {\r\n\t$( this.row( index ).node() ).addClass( 'lowlight' );\r\n} );\r\n\r\n","title":"Add a class to each row in a table"},"since":"1.10","type":{"parameter":[{"content":"If `true` the result set of the returned API instance will be a 1D array (i.e. flattened into a single array). If `false` (or not specified) each result will be concatenated to the instance's result set. Note that this is only relevant if you are returning arrays from the callback.","default":false,"name":"flatten","type":"boolean"},{"content":"Iterator type - see above for the options","name":"type","type":"string"},{"content":["Callback function that is executed on each iteration. For the parameters passed to the function, please refer to the documentation above. As of","this is executed in the scope of an API instance which has its context set to only the table in question."],"name":"callback","type":"function","span":{"content":"1.10.3","class":"since"}},{"content":". Indicate if the callback function will return values or not. If set to `true` a new API instance will be returns with the return values from the callback function in its result set. If not set, or `false` the original instance will be returned for chaining, if no values are returned by the callback method.","default":false,"name":"returns","type":"boolean","span":{"content":"1.10.4","class":"since"}}],"description":"Iterate over a result set of table, row, column or cell indexes","returns":{"content":"Original API instance if the callback returns no result (i.e. `undefined`) or a new API instance with the result set being the results from the callback, in order of execution.","type":"DataTables.Api"},"type":"function","signature":"iterator( [flatten,] type, callback [, returns ] )"},"group":"utility"}}