{"dt-api":{"summary":"Add an ordering listener to an element, for a given column.","description":"This method provides the ability to attach ordering listeners to any DOM element on the page. This is the same method as DataTables uses internally for the ordering listeners which are attached to the header cells for each column, and as such provides the same functionality (i.e. click to order, shift click to multi-column order etc).\r\n\r\n\t\tAlthough not a common method to be used, it can be useful for allowing sorting to be triggered externally from the table (equally `dt-api order()` and its columns counterparts could also be used).\r\n\r\n\t\tNote that unlike `dt-api order()` and `dt-api columns().order()` when the ordering listener attached by this function is activated, it will cause the table to redraw automatically - i.e. there is no need to call `dt-api draw()`.","name":"order.listener()","example":{"content":"\r\nvar table = $('#example').dataTable();\r\n\r\ntable.order.listener( '#sorter', 1 );\r\n","title":"Sort on column 1, when '#sorter' element is clicked upon"},"since":"1.10","type":{"parameter":[{"content":"Selector / node to pick the elements on the page to which the ordering listener should be attached. This can be a DOM node, a jQuery collection of nodes or a jQuery selector string.","name":"node","type":"node|jQuery|string"},{"content":"Column data index of the column that that a click on this node will order the table upon","name":"column","type":"index"},{"content":"Callback function that is executed whenever the ordering performed by the listener is completed, when the listener is activated. No parameters are passed in and no return is expected.","name":"callback","type":"function"}],"description":"Attach an ordering listener to a specified element","returns":{"content":"DataTables API instance with the current order in the result set","type":"DataTables.Api"},"type":"function","signature":"order.listener( node, column, callback )"},"group":"core","related":[{"content":"order","type":"option"},{"content":"ordering","type":"option"},{"content":"order()","type":"api"},{"content":"column().order()","type":"api"},{"content":"columns().order()","type":"api"}]}}