{"dt-api":{"summary":"Get / set the child rows of the selected main table row","description":"DataTables has the ability to show child rows for each row (termed a \"parent row\" in this documentation to distinguish from the child rows). This child rows are attached to each parent row, and can be used, for example, to provide extra information about the parent row, or an editing form. The child rows will always be placed immediately after a parent row (if the child rows are designated to be visible, using the `dt-api row().child.show()` method), regardless of ordering, search terms applied to the table etc. If a parent row is not available in the DataTables' current view, the child rows will not be visible either.\r\n\r\n\t\tThe contents of the child rows are entirely independent of the main table (other than their position in the document). Ordering, searching etc applied to the table has no effect on the order of the child rows. Each child row is typically contains a single cell, which has a `colspan` attribute set to span the full table width, so the content of the cell covers the full table width. However, it is also possible to pass in a `dt-tag tr` element which has multiple cells (one for each column in the table) to show the child row data in the same column structure as the main table.\r\n\r\n\t\tA parent row can have one or more child rows attached to it at a time. However, child rows are treated as one entity by the API, which is to say that they can either all be shown, or all hidden.\r\n\r\n\t\tAdditionally, a child row can persist after they have been hidden, allowing them to quickly and easily be shown again in future if required. The act of hiding a row is performed using `dt-api row().child.hide()`. A Child row can also be destroyed (hidden and its allocated memory released) using `dt-api row().child.remove()` or this method with `false` as the only parameter, if the child row is no longer required.\r\n\r\n\t\tNote that this method does not automatically make the added child row visible when creating a child row. Use the `dt-api row().child().show()` chained method (or `dt-api row().child.show()` as required).","name":"row().child()","example":[{"content":"\r\nvar table = $('#example').DataTable();\r\n\r\n$('#example tbody').on('click', 'td.details-control', function () {\r\n\tvar tr = $(this).parents('tr');\r\n\tvar row = table.row( tr );\r\n\r\n\tif ( row.child.isShown() ) {\r\n\t\t// This row is already open - close it\r\n\t\trow.child.hide();\r\n\t\ttr.removeClass('shown');\r\n\t}\r\n\telse {\r\n\t\t// Open this row (the format() function would return the data to be shown)\r\n\t\trow.child( format(row.data()) ).show();\r\n\t\ttr.addClass('shown');\r\n\t}\r\n} );\r\n\r\n","title":"Show / hide a row based on its current state, adding the row content as needed."},{"content":"\r\nvar table = $('#example').DataTable();\r\n\r\ntable.row( ':eq(0)' ).child( [\r\n\t\t'First child row',\r\n\t\t'Second child row',\r\n\t\t'Third child row'\r\n\t] )\r\n\t.show();\r\n\r\n","title":"Create multiple child rows for a single row in the table - the first visible row."},{"content":"\r\nvar table = $('#example').DataTable();\r\n\r\ntable.rows().every( function () {\r\n\tthis\r\n\t\t.child(\r\n\t\t\t$(\r\n\t\t\t\t'<tr>'+\r\n\t\t\t\t\t'<td>'+rowIdx+'.1<\/td>'+\r\n\t\t\t\t\t'<td>'+rowIdx+'.2<\/td>'+\r\n\t\t\t\t\t'<td>'+rowIdx+'.3<\/td>'+\r\n\t\t\t\t\t'<td>'+rowIdx+'.4<\/td>'+\r\n\t\t\t\t'<\/tr>'\r\n\t\t\t)\r\n\t\t)\r\n\t\t.show();\r\n} );\r\n\r\n","title":"Add a child row to all rows, passing in a jQuery created `dt-tag tr` element and show all child rows"}],"since":"1.10","type":[{"description":"Get the child row(s) that have been set for a parent row","returns":{"content":"jQuery object with the child rows for the parent row in its result set, or `undefined` if there are no child rows set for the parent yet.","type":"jQuery|undefined"},"type":"function","signature":"row().child()"},{"parameter":{"content":"This parameter can be given as `true` or `false`:\r\n\r\n\t\t\t* `true`: Any child rows attached to the parent will be immediately made visible. This is the equivalent of using `dt-api row().child.show()`.\r\n\t\t\t* `false`: If the parent row has any children currently attached to it (whether shown or not) this method will destroy those child rows, removing them from the DOM if appropriate. Unlike with the `dt-api row().child.hide()` method, this option removes the rows from DataTables held memory completely. This is the equivalent of using `dt-api row().child.remove()`.","name":"showRemove","type":"boolean"},"description":"Show or remove and destroy the child rows for the selected row.","returns":{"content":"DataTables API instance","type":"DataTables.Api"},"since":"1.10.1","type":"function","signature":"row().child( showRemove )"},{"parameter":[{"content":"The data to be shown in the child row can be given in multiple different ways:\r\n\r\n\t\t\t* `string` - As a string, a single child row is create and the data is inserted into a single cell in that child row.\r\n\t\t\t* `node` - As a `dt-tag tr` element, the `dt-tag tr` element is used as the child row. This can be useful it you wish to define multiple columns in the child row.\r\n\t\t\t* `jQuery` - A jQuery object with nodes to be added. If there are multiple elements in the jQuery result set, they are added as multiple rows. If the node is `dt-tag tr` element it is treated a the child row, otherwise a row and cell are automatically created and the node from the jQuery result set inserted into it.\r\n\t\t\t* `array` - Multiple child rows can be added at a single time by passing any of the above options in as an array. For example you might pass in an array with two string elements in it to create two child rows with the string content used for each.","name":"data","type":"string|node|jQuery|array"},{"content":"Class name that is added to the `-tag td` cell node(s) of the child row(s) when DataTables generates the child row. As of 1.10.1 it is also added to the `-tag tr` row node of the child row(s).\r\n\r\n\t\t\tThis is useful to add additional styling information to the child row to indicate that while it is part of the table's data, it is additional information beyond what is normally shown.\r\n\r\n\t\t\tPlease note that if a `-type node`, or jQuery object that contains nodes, is given in the first parameter the class name is not automatically added - it is assumed that the existing row is already configured as required.","default":"","name":"className","type":"string"}],"description":"Set the data to show in the child row(s). Note that calling this method will replace any child rows which are already attached to the parent row.","returns":{"content":"DataTables API instance","type":"DataTables.Api"},"type":"function","signature":"row().child( data [, className ] )"}],"group":"rows"}}