{"dt-api":{"summary":"Add multiple new rows to the table.","description":"Adding new data to a table is central to the concept of being able to dynamically control the content of a DataTable, and this method provides the ability to do exactly that, adding multiple new rows at a time. If you wish to add only a single row at a time, this method's singular counterpart, `dt-api row.add()` can be used.\r\n\r\n\t\tThe rows that are added are subjected to the ordering and search criteria that are applied to the table, which will determine the new row's position and visibility in the table.\r\n\r\n\t\tThis method will add the data to the table internally, but does not visually update the tables display to account for this new data. In order to have the table's display updated, use the `dt-api draw()` method, which can be called simply as a chained method of the `dt-api row.add()` method's returned object - for example `table.row.add( [ 1, 2, 3, 4 ] ).draw();`. This is done to allow easy optimisation of the table where multiple rows can be added before the table is redrawn.","name":"rows.add()","example":[{"content":"\r\nvar table = $('#example').DataTable();\r\n\r\ntable.rows.add( [ {\r\n\t\t\"name\":       \"Tiger Nixon\",\r\n\t\t\"position\":   \"System Architect\",\r\n\t\t\"salary\":     \"$3,120\",\r\n\t\t\"start_date\": \"2011/04/25\",\r\n\t\t\"office\":     \"Edinburgh\",\r\n\t\t\"extn\":       \"5421\"\r\n    }, {\r\n\t\t\"name\": \"Garrett Winters\",\r\n\t\t\"position\": \"Director\",\r\n\t\t\"salary\": \"$5,300\",\r\n\t\t\"start_date\": \"2011/07/25\",\r\n\t\t\"office\": \"Edinburgh\",\r\n\t\t\"extn\": \"8422\"\r\n\t} ] )\r\n\t.draw();\r\n","title":"Add two new rows to the table and redraw"},{"content":"\r\nvar table = $('#example').DataTable();\r\n\r\ntable\r\n\t.rows.add( [\r\n\t\tnew Pupil( 43 ),\r\n\t\tnew Pupil( 67 ),\r\n\t\tnew Pupil( 102 )\r\n\t] )\r\n\t.draw()\r\n\t.nodes()\r\n\t.to$()\r\n\t.addClass( 'new' );\r\n\r\n","title":"Add multiple new instances of an object to a table and then add a class to those newly added rows"}],"since":"1.10","type":{"parameter":{"content":"Array of data elements, with each one describing a new row to be added to the table (i.e. `data.length` is the number of new rows that will be added to the table). Each data element may be an array, object, Javascript object instance or a `-tag tr` element. The data structure given must be in the same format as the other data in the table (i.e. if your table uses objects, pass in an object here!).","name":"data","type":"array"},"description":["Add new rows to the table using the data given","Select a row found by a row selector"],"returns":{"content":"DataTables API instance with the newly added rows in its result set.","type":"DataTables.Api"},"type":"function","signature":"rows.add( data )"},"group":"rows","related":{"content":"row.add()","type":"api"}}}